local function run(msg, matches)
    if is_owner(msg) then
        return
    end
    local data = load_data(_config.moderation.data)
    if data[tostring(msg.to.id)] then
        if data[tostring(msg.to.id)]['settings'] then
            if data[tostring(msg.to.id)]['settings']['antifosh'] then
                lock_fosh = data[tostring(msg.to.id)]['settings']['antifosh']
            end
        end
    end
    local chat = get_receiver(msg)
    local user = "user#id"..msg.from.id
    if lock_fosh == "yes" then
        send_large_msg(chat, 'بدلیل فحاشی به اعضای گروه شما به مدتی حذف شدید')
        chat_del_user(chat, user, ok_cb, true)
    end
end
 
return {
  patterns = {
    "[Kk][Ii][Rr]",
    "[Kk][Oo][Ss]",
    "[Nn][Aa][Nn][Aa][Tt]",
    "کس(.*)",
    "کون(.*)",
    "کیر(.*)",
    "ممه(.*)",
    "سکس(.*)",
    "سیکتیر(.*)",
    "قهبه(.*)",
    "بسیک(.*)",
    "بیناموس(.*)",
    "اوبی(.*)",
    "کونی(.*)",
    "بیشرف(.*)",
    "کس ننه(.*)",
    "ساک(.*)",
    "کیری(.*)",
    "خار کوسه(.*)",
    "ننه(.*)",
    "خواهرتو(.*)",
    "سکسی(.*)",
    "کسکش(.*)",
    "سیک تیر(.*)",
    "گاییدم(.*)",
    "میگام(.*)",
    "میگامت(.*)",
    "بسیک(.*)",
    "خواهرت(.*)",
    "خارتو(.*)",
    "کونت(.*)",
    "کوست(.*)",
    "شورت(.*)",
    "سگ(.*)",
    "کیری(.*)",
    "دزد(.*)",
    "ننت(.*)",
    "ابمو(.*)",
    "حرومی(.*)",
    "بخورش(.*)",
    "بلیسش(.*)",
    "کیرم(.*)",
    "بگیرش(.*)",
    "کسده(.*)",
    "کوس(.*)",
    "ننه سگ(.*)",
    "کیر دزد(.*)",
    "تخمم(.*)",
    "رو مخم(.*)",
    "رو کیرم(.*)",
    "کیر خوار(.*)",
    "سیک اوت(.*)",
    "دعوا(.*)",
    "مادرتو(.*)",
    "خواهرت(.*)",
    "نون خوره سره(.*)",
    "کیر سر دره(.*)",
    "کیرم سر دره(.*)",
    "بکنمت(.*)",
    "میکنمت(.*)",
    "جنده(.*)",
    "زنتو(.*)",
    "زنتو گاییدم(.*)",
    "سگ گاییدت(.*)",
    "عمتو(.*)",
    "عمت گاییدم(.*)",
    "عمتو سگ (.*)",
    "مادرت با گراز(.*)",
    "حشرم(.*)",
    "حشری(.*)",
    "کونکش(.*)",
    "گه(.*)",
    "گهخور(.*)",
    "گه نخور(.*)",
    "گهنخور(.*)",
    "آب کیرکو(.*)",
    "اب کیرم(.*)",
    "ریدم دهنت(.*)",
    "گاییدمتون(.*)",
    "اسپم کنم(.*)",
    "اسپم کن(.*)",
    "اسپم بده(.*)",
    "ریدم تو گروه(.*)",
    "کیرمم نیستین(.*)",
    "حرومزاده(.*)",
    "پفیوس(.*)",
    "پفیوز(.*)",
    "دیوس(.*)",
    "جاکش(.*)",
    "kir(.*)",
    "جق(.*)"
  },
  run = run
}
--Copyright and edit; @behroozyaghi
--Persian Translate; @behroozyaghi
--ch : @nod32team
--کپی بدون ذکر منبع حرام است--
